IMPORTING LIBRARIES

In [7]:
import numpy as np 
import pandas as pd

USING THE DATASET TO GET INFORMATION

In [8]:
data = pd.read_csv("dataset.csv")
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               101 non-null    object
 1   NetWorth           101 non-null    object
 2   Age                101 non-null    int64
 3   Country/Territory  101 non-null    object
 4   Source             101 non-null    object
 5   Industry           101 non-null    object
dtypes: int64(1), object(5)
memory usage: 4.9+ KB

In [9]:
d = np.array(data)
print("Shape: ",d.shape)
print("Number of rows: ",d.shape[0])
print("Number of columns: ",d.shape[1])

Shape:  (101, 6)
Number of rows:  101
Number of columns:  6

In [13]:
data.head()

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments

DESCRIBING THE NAME AND NETWORTH COLUMNS

In [17]:
print(data['Name'].describe())
print("------------------------------")
print(data['NetWorth'].describe())

count           101
unique          101
top       Li Xiting
freq              1
Name: Name, dtype: object
------------------------------
count                 101
unique                 87
top       $24,300,000,000
freq                    3
Name: NetWorth, dtype: object

ANALYZING THE RICHEST PEOPLE

In [20]:
print("TOP 5 RICHEST PEOPLE")
print(data.iloc[0:5,0:3])
print("Youngest Person: \n",data[data['Age']==data['Age'].min()].iloc[:,0:3])
print("Oldest Person: \n",data[data['Age']==data['Age'].max()].iloc[:,0:3])

TOP 5 RICHEST PEOPLE
                       Name          NetWorth  Age
0                 Elon Musk  $219,000,000,000   50
1                Jeff Bezos  $171,000,000,000   58
2  Bernard Arnault & family  $158,000,000,000   73
3                Bill Gates  $129,000,000,000   66
4            Warren Buffett  $118,000,000,000   91
Youngest Person:
                  Name         NetWorth  Age
59  Sam Bankman-Fried  $24,000,000,000   30
Oldest Person:
             Name         NetWorth  Age
38  Lee Shau Kee  $32,600,000,000   94

CALCULATING MEAN AND MODE

In [21]:
print("Mean: ",data['Age'].mean())
print("Mode: ",data['Age'].median())

Mean:  67.11881188118812
Mode:  67.0

DUPLICATES

In [22]:
data.drop_duplicates() #there are no duplicates

,Name,NetWorth,Age,Country/Territory,Source,Industry
0,Elon Musk,"$219,000,000,000",50,United States,"Tesla, SpaceX",Automotive
1,Jeff Bezos,"$171,000,000,000",58,United States,Amazon,Technology
2,Bernard Arnault & family,"$158,000,000,000",73,France,LVMH,Fashion & Retail
3,Bill Gates,"$129,000,000,000",66,United States,Microsoft,Technology
4,Warren Buffett,"$118,000,000,000",91,United States,Berkshire Hathaway,Finance & Investments
...,...,...,...,...,...,...
96,Vladimir Potanin,"$17,300,000,000",61,Russia,metals,Metals & Mining
97,Harold Hamm & family,"$17,200,000,000",76,United States,oil & gas,Energy
98,Sun Piaoyang,"$17,100,000,000",63,China,pharmaceuticals,Healthcare
99,Luo Liguo & family,"$17,000,000,000",66,China,chemicals,Manufacturing
100,Peter Woo,"$17,000,000,000",75,Hong Kong,real estate,Real Estate

MISSING VALUES

In [23]:
n = data.shape[0] - data.dropna().shape[0]
print ("%d rows have missing values in the data" %n)
print("Row-wise analysis: ")
data.isnull().sum()

0 rows have missing values in the data
Row-wise analysis:

Name                 0
NetWorth             0
Age                  0
Country/Territory    0
Source               0
Industry             0
dtype: int64

REPLACING VALUES

In [25]:
data["Country/Territory"].replace("United States", "USA",inplace=True)
print(data)

                         Name          NetWorth  Age Country/Territory  \
0                   Elon Musk  $219,000,000,000   50               USA
1                  Jeff Bezos  $171,000,000,000   58               USA
2    Bernard Arnault & family  $158,000,000,000   73            France
3                  Bill Gates  $129,000,000,000   66               USA
4              Warren Buffett  $118,000,000,000   91               USA
..                        ...               ...  ...               ...
96           Vladimir Potanin   $17,300,000,000   61            Russia
97       Harold Hamm & family   $17,200,000,000   76               USA
98               Sun Piaoyang   $17,100,000,000   63             China
99         Luo Liguo & family   $17,000,000,000   66             China
100                 Peter Woo   $17,000,000,000   75         Hong Kong

                 Source               Industry
0         Tesla, SpaceX             Automotive
1                Amazon             Technology
2                  LVMH       Fashion & Retail
3             Microsoft             Technology
4    Berkshire Hathaway  Finance & Investments
..                  ...                    ...
96               metals        Metals & Mining
97            oil & gas                 Energy
98      pharmaceuticals             Healthcare
99            chemicals          Manufacturing
100         real estate            Real Estate

[101 rows x 6 columns]

COLUMN RENAMING

In [26]:
data.rename(columns = {'Country/Territory':'Country', 'Source':'Business'}, inplace = True)
print(data)

                         Name          NetWorth  Age    Country  \
0                   Elon Musk  $219,000,000,000   50        USA
1                  Jeff Bezos  $171,000,000,000   58        USA
2    Bernard Arnault & family  $158,000,000,000   73     France
3                  Bill Gates  $129,000,000,000   66        USA
4              Warren Buffett  $118,000,000,000   91        USA
..                        ...               ...  ...        ...
96           Vladimir Potanin   $17,300,000,000   61     Russia
97       Harold Hamm & family   $17,200,000,000   76        USA
98               Sun Piaoyang   $17,100,000,000   63      China
99         Luo Liguo & family   $17,000,000,000   66      China
100                 Peter Woo   $17,000,000,000   75  Hong Kong

               Business               Industry
0         Tesla, SpaceX             Automotive
1                Amazon             Technology
2                  LVMH       Fashion & Retail
3             Microsoft             Technology
4    Berkshire Hathaway  Finance & Investments
..                  ...                    ...
96               metals        Metals & Mining
97            oil & gas                 Energy
98      pharmaceuticals             Healthcare
99            chemicals          Manufacturing
100         real estate            Real Estate

[101 rows x 6 columns]

AGE WISE CLASSIFICATION

In [27]:
bins = [25, 35, 60, 100]
bin_names = ['Young', 'MiddleAge', 'Senior']
cuts = pd.cut(data['Age'], bins,labels=bin_names)
pd.value_counts(cuts)

Senior       65
MiddleAge    35
Young         1
Name: Age, dtype: int64